{
    "stable": {
        "quickchart": {
            "app_readme": "QUICKCHART:\nSimular to TrueNAS SCALE's \"Custom App\", Quickchart is a simple deployment workflow for any single application container, however it exposes additional Kubernetes configuration not current available.\n\nNETWORK SERVICE EXTERNALIPS:\nThis allows for IP addresses to be managed manually.  As Kubernetes orchestration does not manage allication of ExternalIPs, these addresses become the responsibility of the custer adminstrator. Then configured, the external IPs traffic, with the matching port, is routed to the network service and onto the container.\n\nNETWORKING WORKFLOW TIPS:\nTo expose IP addresses to use as ExternalIP for a ClusterIP, simply add them as Aliases to the network interface.\n\nAs IP addresses will be managed outside of orchestration conflicts can occur. Avoided using the same port on different containers that also use the same IP address.\n\nBy default TureNAS uses 0.0.0.0 for the Web Interface Address, which means any IP addresses on the host will use ports 80 or 443 for the WebUI. If these ports need to be defined on the ExternalIP for a Container, remove this conflict by changing the Web Interface Address from 0.0.0.0 to specific IP addresses.\n\nBy default Kubernetes limits container/pod communication with the host including Virtual Machines within TrueNAS SCALE.  If this is needed a common workaround is to use a bridge interface with host IP addresses joined to the physical network interface.  Virtual Machines will also need to use this bridge.",
            "categories": [
                "generic"
            ],
            "description": "Generic Kubernetes Chart for TrueNAS SCALE using additional Kubernetes configuration not current available on \"Custom App\".",
            "healthy": true,
            "healthy_error": null,
            "home": "https://www.truenas.com/",
            "location": "/__w/charts/charts/stable/quickchart",
            "latest_version": "2.0.2",
            "latest_app_version": "quickchart",
            "latest_human_version": "quickchart_2.0.2",
            "last_update": "2023-09-26 14:26:10",
            "name": "quickchart",
            "recommended": false,
            "title": "quickchart",
            "maintainers": [
                {
                    "name": "soleous",
                    "url": "https://github.com/soleous/fluidcharts/",
                    "email": "Undefined"
                }
            ],
            "tags": [],
            "screenshots": [],
            "sources": [
                "https://github.com/soleous/fluidcharts/"
            ],
            "icon_url": "https://soleous.github.io/fluidcharts/quickchart/images/icon.png"
        }
    }
}